# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanarFace..::..Origin Property
PlanarFace Class See Also
---
Origin of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
PlanarFace Class
Autodesk.Revit.DB Namespace